"""
Парсер для docx файла с данными расклада 'Энергия года'.

Этот модуль преобразует docx файл с архетипами года в CSV формат,
который затем используется для загрузки данных в бот.

Формат входного docx:
- Каждый архетип начинается со строки вида "N Архетип — Название_карты"
- За названием следует описание архетипа

Формат выходного CSV:
- card_name: название карты Таро (соответствует названиям в cards.csv)
- description: полное описание архетипа года для этой карты

Использование:
    python src/utils/parse_year_energy.py
"""

import csv
import re
from pathlib import Path
from docx import Document


# Маппинг сокращённых названий на полные названия карт
CARD_NAME_MAPPING = {
    "Маг": "Маг",
    "Жрица": "Верховная Жрица",
    "Императрица": "Императрица",
    "Император": "Император",
    "Жрец": "Иерофант",
    "Влюблённые": "Влюбленные",
    "Влюбленные": "Влюбленные",
    "Колесница": "Колесница",
    "Справедливость": "Справедливость",
    "Отшельник": "Отшельник",
    "Колесо фортуны": "Колесо Фортуны",
    "Колесо Фортуны": "Колесо Фортуны",
    "Сила": "Сила",
    "Повешенный": "Повешенный",
    "Смерть": "Смерть",
    "Умеренность": "Умеренность",
    "Дьявол": "Дьявол",
    "Башня": "Башня",
    "Звезда": "Звезда",
    "Луна": "Луна",
    "Солнце": "Солнце",
    "Суд": "Суд",
    "Мир": "Мир",
    "Шут": "Шут",
}


def extract_card_name(text: str) -> str | None:
    """Извлекает название карты из строки вида '1 Архетип — Маг 🧚‍♀️'."""
    # Сначала проверяем многословные названия (нечувствительно к регистру)
    text_lower = text.lower()
    if "верховная" in text_lower and "жрица" in text_lower:
        return "Верховная Жрица"
    if "колесо" in text_lower and ("фортуны" in text_lower or "фортун" in text_lower):
        return "Колесо Фортуны"
    if "повешенный" in text_lower or "повешенны" in text_lower:
        return "Повешенный"
    
    # Убираем эмодзи и специальные символы, но сохраняем пробелы для многословных названий
    text_clean = re.sub(r'[^\w\s—\-]', '', text)
    
    # Ищем паттерн "Архетип — Название" (может быть многословным)
    match = re.search(r'Архетип\s*—\s*([А-Яа-яЁё\s]+)', text_clean)
    if match:
        card_name = match.group(1).strip()
        card_name_lower = card_name.lower()
        # Проверяем многословные варианты (нечувствительно к регистру)
        if "колесо" in card_name_lower and ("фортуны" in card_name_lower or "фортун" in card_name_lower):
            return "Колесо Фортуны"
        if "верховная" in card_name_lower and "жрица" in card_name_lower:
            return "Верховная Жрица"
        if "повешенный" in card_name_lower or "повешенны" in card_name_lower:
            return "Повешенный"
        # Берем первое слово для однозначных карт
        first_word = card_name.split()[0] if card_name.split() else card_name
        return CARD_NAME_MAPPING.get(first_word, first_word)
    
    # Альтернативный паттерн: номер и название
    match = re.search(r'\d+\s+Архетип\s*—\s*([А-Яа-яЁё\s]+)', text_clean)
    if match:
        card_name = match.group(1).strip()
        card_name_lower = card_name.lower()
        # Проверяем многословные варианты (нечувствительно к регистру)
        if "колесо" in card_name_lower and ("фортуны" in card_name_lower or "фортун" in card_name_lower):
            return "Колесо Фортуны"
        if "верховная" in card_name_lower and "жрица" in card_name_lower:
            return "Верховная Жрица"
        if "повешенный" in card_name_lower or "повешенны" in card_name_lower:
            return "Повешенный"
        first_word = card_name.split()[0] if card_name.split() else card_name
        return CARD_NAME_MAPPING.get(first_word, first_word)
    
    # Если просто название карты в тексте
    for key in sorted(CARD_NAME_MAPPING.keys(), key=len, reverse=True):  # Сначала длинные названия
        if key in text:
            return CARD_NAME_MAPPING[key]
    
    return None


def parse_year_energy_docx(docx_path: str | Path, output_csv_path: str | Path) -> None:
    """
    Парсит docx файл с данными расклада 'Энергия года' и сохраняет в CSV.
    
    Ожидаемый формат docx:
    - Строка с номером и названием архетипа (например, "1 Архетип — Маг 🧚‍♀️")
    - Строка с описанием года, заканчивающаяся на "Небольшие подсказки:"
    - Несколько строк с советами (каждый совет на отдельной строке)
    - Пустая строка перед следующим архетипом
    """
    doc = Document(docx_path)
    
    paragraphs = [p.text for p in doc.paragraphs]
    archetypes = []
    
    i = 0
    while i < len(paragraphs):
        text = paragraphs[i].strip()
        
        # Пытаемся найти начало нового архетипа
        card_name = extract_card_name(text)
        
        if card_name:
            # Нашли новый архетип
            # Следующая строка должна содержать описание и "Небольшие подсказки:"
            if i + 1 < len(paragraphs):
                description_line = paragraphs[i + 1].strip()
                
                # Разделяем описание и "Небольшие подсказки:"
                if "Небольшие подсказки:" in description_line:
                    # Описание - это всё до "Небольшие подсказки:"
                    description = description_line.split("Небольшие подсказки:")[0].strip()
                    tips_header = "Небольшие подсказки:"
                else:
                    # Если "Небольшие подсказки:" не найдено, берём всю строку как описание
                    description = description_line
                    tips_header = ""
                
                # Собираем советы (строки после описания до пустой строки или следующего архетипа)
                tips = []
                j = i + 2  # Начинаем со строки после описания
                
                while j < len(paragraphs):
                    tip_text = paragraphs[j].strip()
                    
                    # Если пустая строка или начало нового архетипа - заканчиваем сбор советов
                    if not tip_text:
                        break
                    if extract_card_name(tip_text):
                        break
                    
                    # Если это не пустая строка и не новый архетип - это совет
                    if tip_text:
                        tips.append(tip_text)
                    
                    j += 1
                
                # Формируем итоговое описание
                full_description = description
                
                if tips_header and tips:
                    # Добавляем заголовок "Небольшие подсказки:" и список советов
                    full_description += "\n" + tips_header + "\n"
                    # Форматируем советы с маркерами
                    formatted_tips = "\n".join([f"•\t{tip}" for tip in tips])
                    full_description += formatted_tips
                elif tips:
                    # Если нет заголовка, но есть советы, добавляем их
                    formatted_tips = "\n".join([f"•\t{tip}" for tip in tips])
                    full_description += "\n" + formatted_tips
                
                archetypes.append({
                    'card_name': card_name,
                    'description': full_description.strip()
                })
                
                # Переходим к следующему архетипу (пропускаем обработанные строки)
                i = j
            else:
                # Если нет следующей строки, просто сохраняем архетип без описания
                archetypes.append({
                    'card_name': card_name,
                    'description': ''
                })
                i += 1
        else:
            # Если не нашли архетип, просто переходим к следующей строке
            i += 1
    
    # Убираем дубликаты (оставляем первый)
    seen = set()
    unique_archetypes = []
    for arch in archetypes:
        if arch['card_name'] not in seen:
            seen.add(arch['card_name'])
            unique_archetypes.append(arch)
        else:
            # Если дубликат, объединяем описания
            for existing in unique_archetypes:
                if existing['card_name'] == arch['card_name']:
                    existing['description'] += '\n\n' + arch['description']
                    break
    
    # Сохраняем в CSV
    with open(output_csv_path, 'w', encoding='utf-8', newline='') as f:
        writer = csv.DictWriter(f, fieldnames=['card_name', 'description'])
        writer.writeheader()
        writer.writerows(unique_archetypes)
    
    print(f"Парсинг завершён. Найдено {len(unique_archetypes)} уникальных архетипов.")
    print(f"Результат сохранён в {output_csv_path}")
    
    # Выводим список найденных карт для проверки
    print("\nНайденные карты:")
    for arch in unique_archetypes:
        print(f"  - {arch['card_name']}")


if __name__ == "__main__":
    # Пути к файлам
    data_dir = Path(__file__).parent.parent / "data"
    docx_path = data_dir / "архетипы года с советами.docx"
    output_path = data_dir / "year_energy_archetypes.csv"
    
    if not docx_path.exists():
        print(f"Файл {docx_path} не найден!")
        exit(1)
    
    parse_year_energy_docx(docx_path, output_path)

